Revit 2027 API
BuiltInFailures.DPartFailures.DivideVolumesProfilesEdgeMatchForWidthAll Property
 Division family cannot be used with the selected edge condition for all widths of hosts
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DivideVolumesProfilesEdgeMatchForWidthAll { get; }
Public Shared ReadOnly Property DivideVolumesProfilesEdgeMatchForWidthAll As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DivideVolumesProfilesEdgeMatchForWidthAll {
	FailureDefinitionId^ get ();
}
static member DivideVolumesProfilesEdgeMatchForWidthAll : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DPartFailures Class
Autodesk.Revit.DB Namespace